Repository: pabloblgra/cartero
Catalog: po/*.po
Languages: ca, es, ru

source: Make HTTP requests and test APIs
ca: Fes peticions HTTP i testeja APIs
es: Haz peticiones HTTP y prueba APIs
ru: Выполняйте HTTP-запросы и тестируйте API

source: Cartero is a graphical HTTP client that can be used as a developer tool to test web APIs and perform all kind of HTTP requests to web servers. It is compatible with any REST, SOAP or XML-RPC API and it supports multiple request methods as well as attaching body payloads to compatible requests.
ca: Cartero és un client HTTP gràfic el qual es pot utilitzar com una eina dedesenvolupament per testejar APIs web i fer qualsevol classe de peticions HTTP a serveis web. És compatible amb qualsevol API REST, SOAP o XML-RPC i suporta múltiples mètodes de petició així com adjuntar cossos a les peticions compatibles.
es: Cartero es un cliente HTTP gráfico que puede usarse como herramienta de desarrollo para probar APIs web y hacer todo tipo de peticiones HTTP a servicios web. Es compatible con cualquier API REST, SOAP o XML-RPC y soporta múltiples métodos de petición así como adjuntar cuerpos a las peticiones compatibles.
ru: Cartero — это графический HTTP-клиент, который можно использовать как инструмент разработчика для тестирования веб-API и выполнения различных HTTP-запросов к веб-серверам. Приложение совместимо с API REST, SOAP или XML-RPC и поддерживает несколько методов запросов, а также позволяет прикреплять тело запроса к совместимым методам.

source: Features:
ca: Característiques:
es: Características:
ru: Особенности:

source: Loads and saves to plain Git-friendly TOML files, so that you can own your data.
ca: Carrega i guarda a arxius TOML amigables amb Git, perquè puguis tenir les teves dades.
es: Carga y guarda a archivos TOML amigables con Git, para que puedas poseer tus datos.
ru: Загружает и сохраняет данные в простых файлах TOML, совместимых с Git, что позволяет вам контролировать свои данные.

source: Customization and modification of the request headers and body payloads.
ca: Personalització i modificació de les capçaleres i cossos d'una petició.
es: Personalización y modificación de las cabeceras y cuerpos de una petición.
ru: Настройка и изменение заголовков запроса и содержимого тела запроса.

source: Variable binding for API keys and other secret information.
ca: Enllaçament de variables per claus API i altres tipus d'informació secreta.
es: Enlazado de variables para claves API y otra información secreta.
ru: Привязка переменных для API-ключей и другой конфиденциальной информации.

source: Main window of Cartero
ca: Finestra principal de Cartero
es: Ventana principal de Cartero
ru: Главное окно Cartero

source: Modifying HTTP headers
ca: Modificant les capçaleres HTTP
es: Modificando las cabeceras HTTP
ru: Изменение HTTP-заголовков

source: Setting the request payload
ca: Establint el cos de la petició
es: Estableciendo el cuerpo de la petición
ru: Настройка тела запроса

source: Automatically indent new lines for the request body
ca: Indentar automàticament noves línies del cos de la petició
es: Indentar automáticamente nuevas líneas el cuerpo de la petición
ru: Автоматически добавлять отступы для новых строк тела запроса

source: Wrap the body content
ca: Salts de línia en el cos
es: Saltos de línea en el cuerpo
ru: Переносить содержимое тела запроса

source: Whether to indent the request body with spaces or tabs
ca: Indentar el cos de la petició amb espais o tabuladors
es: Indentar el cuerpo de la petición con espacios o con tabuladores
ru: Использовать отступы в теле запроса: пробелы или табуляции

source: Show line numbers in the request and response bodies
ca: Mostrar els números de línia en els cossos de petició i resposta
es: Mostrar los números de línea en los cuerpos de petición y respuesta
ru: Показывать номера строк в теле запроса и ответа

source: How many characters to pad when indenting the request body
ca: Quants caràcters utilitzar al indentar el cos de la petició
es: Cuántos caracteres usar al indentar el cuerpo de la petición
ru: Количество символов для отступов в теле запроса

source: How large should new windows be
ca: Que llargues han de ser les finestres noves
es: Cómo de largas deben ser las ventanas nuevas
ru: Размер новых окон

source: How tall should new windows be
ca: Que altes han de ser les finestres noves
es: Cómo de altas deben ser las ventanas nuevas
ru: Высота новых окон

source: Whether the application should open maximized
ca: Si l'aplicació hauria d'obrir-se maximitzada
es: Si la aplicación se debe abrir maximizada
ru: Открывать приложение в полноэкранном режиме

source: The position of the split between two windows
ca: La posició del separador entre ambdues finestres
es: La posición del separador entre ambas ventanas
ru: Расположение разделения между двумя окнами

source: The current list of opened files
ca: La llista actual d'arxius oberts
es: La lista actual de archivos abiertos
ru: Текущий список открытых файлов

source: The last location where a file was opened
ca: L'última ubicació on es va obrir un arxiu
es: La última ubicación donde se abrió un archivo
ru: Последнее место, где был открыт файл

source: The last location where a file was saved
ca: L'última ubicació on es va guardar un arxiu
es: La última ubicación donde se guardó un archivo
ru: Последнее место, где был сохранён файл

# shortcuts window
source: General shortcuts
es: Atajos generales
ru: Общие

# shortcuts window
source: Show Keyboard Shortcuts
es: Mostrar atajos de teclado
ru: Показать комбинации клавиш

# shortcuts window
source: Quit
es: Salir
ru: Выход

# shortcuts window
source: Tab operations
es: Operaciones de pestaña
ru: Операции с вкладками

# shortcuts window
source: New request tab
es: Nueva pestaña de petición
ru: Новая вкладка запроса

# shortcuts window
source: Open request
es: Abrir petición
ru: Открыть запрос

# shortcuts window
source: Save request
es: Guardar petición
ru: Сохранить запрос

# shortcuts window
source: Save request as
es: Guardar petición como
ru: Сохранить запрос как

# shortcuts window
source: Close request tab
es: Cerrar pestaña de petición
ru: Закрыть вкладку запроса

# shortcuts window
source: Request operations
es: Operaciones de petición
ru: Операции с запросом

# shortcuts window
source: Send request
es: Enviar petición
ru: Отправить запрос

source: Copy
ca: Copiar
es: Copiar

source: Request URL
ca: URL de petició
es: URL de petición
ru: URL-адрес запроса

source: Send
ca: Enviar
es: Enviar
ru: Отправить

source: Execute this HTTP request
ca: Executar aquesta petició HTTP
es: Ejecutar esta petición HTTP
ru: Выполнить этот HTTP-запрос

source: Parameters
ca: Paràmetres
es: Parámetros
ru: Параметры

source: Headers
ca: Capçaleres
es: Cabeceras
ru: Заголовки

source: Body
ca: Cos
es: Cuerpo
ru: Тело

source: Export request
ca: Exportar petició
es: Exportar petición

source: Export to
ca: Exportar com
es: Exportar como

source: (none)
ca: (nada)
es: (nada)
ru: (нет)

source: Name
ca: Nom
es: Nombre
ru: Имя

source: Value
ca: Valor
es: Valor
ru: Значение

source: Actions
ca: Accions
es: Acciones
ru: Действия

source: Toggle secret
ca: Alternar secret
es: Alternar secreto
ru: Скрыть значение

source: Delete
ca: Esborrar
es: Borrar
ru: Удалить

source: New
ca: Nou
es: Nuevo
ru: Новая вкладка

source: Open
ca: Obrir
es: Abrir
ru: Открыть

source: Save
ca: Guardar
es: Guardar
ru: Сохранить

source: Welcome to Cartero
ca: Benvolgut a Cartero
es: Bienvenido a Cartero
ru: Добро пожаловать в Cartero

source: Create or open a request and start testing APIs now.
ca: Crea o obre una petició i comença a provar APIs ara.
es: Crea o abre una petición y empieza a probar APIs ahora.
ru: Создайте или откройте запрос и начните тестировать API прямо сейчас.

source: New tab
ca: Nova pestanya
es: Nueva pestaña
ru: Новая вкладка

source: Open request...
es: Abrir petición...

source: Save request
ca: Guardar petició
es: Guardar petición
ru: Сохранить запрос

source: Save request as...
es: Guardar petición como...

source: Close tab
ca: Tancar pestanya
es: Cerrar pestaña
ru: Закрыть вкладку

source: Body appearance
ca: Aparença del cos
es: Apariencia del cuerpo
ru: Внешний вид тела запроса

source: Wrap content
ca: Adaptar contingut
es: Adaptar contenido
ru: Переносить содержимое

source: Show line numbers
ca: Mostrar números de línia
es: Mostrar números de línea
ru: Показывать номера строк

source: Automatic indentation
ca: Indentar automàticament
es: Indentar automáticamente
ru: Автоматический отступ

source: Indent with spaces
ca: Indentar amb espais
es: Indentar con espacios
ru: Пробелы

source: Indent with tabs
ca: Indentar amb tabuladors
es: Indentar con tabuladores
ru: Табуляция

source: Spaces per tab
ca: Espais per tabulador
es: Espacios por tabulador
ru: Пробелов на табуляцию

source: Keyboard shortcuts
ca: Dreceres de teclat
es: Atajos de teclado
ru: Комбинации клавиш

source: About Cartero
ca: Quant a Cartero
es: Acerca de Cartero
ru: О приложении

source: Quit
ca: Sortir
es: Salir
ru: Выход

source: Request method
ca: Mètode de petició
es: Método de petición
ru: Метод запроса

source: Body type
ca: Tipus de cos
es: Tipo de cuerpo
ru: Тип тела

source: Multipart Form Data
ca: Formulari Multipart
es: Formulario Multipart
ru: Многочастичные данные

source: Raw
ca: En brut
es: En bruto
ru: Простой

source: Ready to request
ca: Preparat per enviar
es: Listo para enviar
ru: Готов к запросу

source: Use the Send button to send a network request and it will show here.
ca: Utilitza el botó Enviar per enviar una petició de xarxa i veure el resultat aquí.
es: Usa el botón Enviar para enviar una petición de red y ver el resultado aquí.
ru: Нажмите кнопку «Отправить», чтобы выполнить сетевой запрос. Результат появится здесь.

source: Save changes?
ca: ¿Guardar cambis?
es: ¿Guardar cambios?
ru: Сохранить изменения?

source: There are changes that have not been saved yet. What do you want to do?
ca: Hi ha canvis que encara no han sigut guardats. ¿Què vols fer?
es: Hay cambios que todavía no han sido guardados. ¿Qué quieres hacer?
ru: Есть несохраненные изменения. Что вы хотите сделать?

source: _Cancel
ca: _Cancel·lar
es: _Cancelar
ru: _Отмена

source: _Discard
ca: _Descartar
es: _Descartar
ru: _Отменить

source: _Save
ca: _Guardar
es: _Guardar
ru: _Сохранить

source: Content copied to the clipboard
ca: Contingut copiat al porta-retalls
es: Contenido copiado al portapapeles

source: Request (.cartero)
ca: Petició (.cartero)
es: Petición (.cartero)
ru: Запрос (.cartero)

source: Request
ca: Petició
es: Petición
ru: Запрос

source: Open request
ca: Obir petició
es: Abrir petición
ru: Открыть запрос

source: (untitled)
ca: (sense títol)
es: (sin título)
ru: (без названия)

source: Draft
ca: Esborrany
es: Borrador
ru: Черновик

source: The Cartero authors
ca: Els autors de Cartero
es: Los autores de Cartero
ru: Авторы Cartero

source: © 2024 the Cartero authors
ca: © 2024 Els autors de Cartero
es: © 2024 los autores de Cartero
ru: © 2024 Авторы Cartero

source: Variables
ru: Переменные

source: Open request…
ca: Obrir petició…
ru: Открыть запрос…

source: Save request as…
ca: Guardar petició com…
ru: Сохранить запрос как…

source: URL Encoded
ru: Кодированный URL
